fonecmid-diplom/src/Documents/BKM_ГрафикОтпусков/BKM_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BKM_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.BKM_ОтпускаСотрудников</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/BKM_ОтпускаСотрудников/BKM_ОтпускаСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BKM_ОтпускаСотрудников</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/BKM_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	BKM_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	BKM_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	BKM_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	Документ.BKM_ГрафикОтпусков.ОтпускаСотрудников КАК BKM_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	BKM_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Движения.BKM_ОтпускаСотрудников.Записывать = Истина;
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.BKM_ОтпускаСотрудников.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Год = Год;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Количество = (Выборка.ДатаОкончания - Выборка.ДатаНачала) / 86400;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
